; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l9-t1-p3---int100n150-m25---int100c110---s86---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level18 level18)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level18 level19)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level18 level20)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level18 level21)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level18 level22)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level18 level23)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level18 level24)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level18 level25)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level18 level26)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level18 level27)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level18 level28)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level18 level29)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level18 level30)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level18 level31)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level18 level32)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level18 level33)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level18 level34)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level18 level35)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level18 level36)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level18 level37)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level18 level38)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level18 level39)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level12 level34)
(sum level22 level13 level35)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level18 level40)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level12 level35)
(sum level23 level13 level36)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level18 level41)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level12 level36)
(sum level24 level13 level37)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level18 level42)
(sum level25 level2 level27)
(sum level25 level4 level29)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level12 level37)
(sum level25 level13 level38)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level18 level43)
(sum level26 level2 level28)
(sum level26 level4 level30)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level12 level38)
(sum level26 level13 level39)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level18 level44)
(sum level27 level2 level29)
(sum level27 level4 level31)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level12 level39)
(sum level27 level13 level40)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level18 level45)
(sum level28 level2 level30)
(sum level28 level4 level32)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level12 level40)
(sum level28 level13 level41)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level18 level46)
(sum level29 level2 level31)
(sum level29 level4 level33)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level12 level41)
(sum level29 level13 level42)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level18 level47)
(sum level30 level2 level32)
(sum level30 level4 level34)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level12 level42)
(sum level30 level13 level43)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level18 level48)
(sum level31 level2 level33)
(sum level31 level4 level35)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level12 level43)
(sum level31 level13 level44)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level18 level49)
(sum level32 level2 level34)
(sum level32 level4 level36)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level12 level44)
(sum level32 level13 level45)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level18 level50)
(sum level33 level2 level35)
(sum level33 level4 level37)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level12 level45)
(sum level33 level13 level46)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level18 level51)
(sum level34 level2 level36)
(sum level34 level4 level38)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level12 level46)
(sum level34 level13 level47)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level35 level2 level37)
(sum level35 level4 level39)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level12 level47)
(sum level35 level13 level48)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level36 level2 level38)
(sum level36 level4 level40)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level12 level48)
(sum level36 level13 level49)
(sum level36 level15 level51)
(sum level37 level2 level39)
(sum level37 level4 level41)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level12 level49)
(sum level37 level13 level50)
(sum level38 level2 level40)
(sum level38 level4 level42)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level12 level50)
(sum level38 level13 level51)
(sum level39 level2 level41)
(sum level39 level4 level43)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level12 level51)
(sum level40 level2 level42)
(sum level40 level4 level44)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level41 level2 level43)
(sum level41 level4 level45)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level10 level51)
(sum level42 level2 level44)
(sum level42 level4 level46)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level43 level2 level45)
(sum level43 level4 level47)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level44 level2 level46)
(sum level44 level4 level48)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level45 level2 level47)
(sum level45 level4 level49)
(sum level45 level6 level51)
(sum level46 level2 level48)
(sum level46 level4 level50)
(sum level47 level2 level49)
(sum level47 level4 level51)
(sum level48 level2 level50)
(sum level49 level2 level51)

(connected l0 l1)
(fuelcost level4 l0 l1)
(connected l0 l2)
(fuelcost level10 l0 l2)
(connected l0 l3)
(fuelcost level12 l0 l3)
(connected l0 l7)
(fuelcost level2 l0 l7)
(connected l1 l0)
(fuelcost level4 l1 l0)
(connected l1 l4)
(fuelcost level4 l1 l4)
(connected l1 l7)
(fuelcost level6 l1 l7)
(connected l1 l8)
(fuelcost level18 l1 l8)
(connected l2 l0)
(fuelcost level10 l2 l0)
(connected l2 l3)
(fuelcost level15 l2 l3)
(connected l2 l6)
(fuelcost level16 l2 l6)
(connected l2 l7)
(fuelcost level13 l2 l7)
(connected l3 l0)
(fuelcost level12 l3 l0)
(connected l3 l2)
(fuelcost level15 l3 l2)
(connected l3 l6)
(fuelcost level11 l3 l6)
(connected l3 l7)
(fuelcost level7 l3 l7)
(connected l4 l1)
(fuelcost level4 l4 l1)
(connected l5 l6)
(fuelcost level2 l5 l6)
(connected l6 l2)
(fuelcost level16 l6 l2)
(connected l6 l3)
(fuelcost level11 l6 l3)
(connected l6 l5)
(fuelcost level2 l6 l5)
(connected l7 l0)
(fuelcost level2 l7 l0)
(connected l7 l1)
(fuelcost level6 l7 l1)
(connected l7 l2)
(fuelcost level13 l7 l2)
(connected l7 l3)
(fuelcost level7 l7 l3)
(connected l8 l1)
(fuelcost level18 l8 l1)

(at t0 l5)
(fuel t0 level51)
(= (total-cost) 0)

(at p0 l6)
(at p1 l0)
(at p2 l4)
)

(:goal
(and
(at p0 l1)
(at p1 l4)
(at p2 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l5 l6 level49 level2 level51)
   deleted: (at t0 l5) (fuel t0 level51)
   added: (at t0 l6) (fuel t0 level49)
   goals met: 0 of 3
2. (load p0 t0 l6)
   deleted: (at p0 l6)
   added: (in p0 t0)
   goals met: 0 of 3
3. (drive t0 l6 l3 level38 level11 level49)
   deleted: (at t0 l6) (fuel t0 level49)
   added: (at t0 l3) (fuel t0 level38)
   goals met: 0 of 3
4. (drive t0 l3 l0 level26 level12 level38)
   deleted: (at t0 l3) (fuel t0 level38)
   added: (at t0 l0) (fuel t0 level26)
   goals met: 0 of 3
5. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 3
6. (drive t0 l0 l1 level22 level4 level26)
   deleted: (at t0 l0) (fuel t0 level26)
   added: (at t0 l1) (fuel t0 level22)
   goals met: 0 of 3
7. (drive t0 l1 l4 level18 level4 level22)
   deleted: (at t0 l1) (fuel t0 level22)
   added: (at t0 l4) (fuel t0 level18)
   goals met: 0 of 3
8. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 0 of 3
9. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 1 of 3
10. (drive t0 l4 l1 level14 level4 level18)
   deleted: (at t0 l4) (fuel t0 level18)
   added: (at t0 l1) (fuel t0 level14)
   goals met: 1 of 3
11. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 3
12. (drive t0 l1 l7 level8 level6 level14)
   deleted: (at t0 l1) (fuel t0 level14)
   added: (at t0 l7) (fuel t0 level8)
   goals met: 2 of 3
13. (drive t0 l7 l3 level1 level7 level8)
   deleted: (at t0 l7) (fuel t0 level8)
   added: (at t0 l3) (fuel t0 level1)
   goals met: 2 of 3
14. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 3 of 3
